[

  {
    "id" : 1,
    "category" : 1,
    "name" : "Night of the Living Dead (1968)",
    "plot" : "In this classic yet still creepy horror film, strangers hold up in a rural Pennsylvania farmhouse and battle constant attacks from dead locals who have been brought back to life by mysterious radiation.",
    "poster" : "https://upload.wikimedia.org/wikipedia/en/9/91/Night_of_the_Living_Dead_%281968%29_poster.jpg",
    "ranking" : 2,
    "lenght" : "1h 35m",
    "videoUrl" : "http://publicdomainmovie.net/movie.php?id=night_of_the_living_dead&type=.mp4"
  },

  {
    "id" : 2,
    "category" : 2,
    "name" : "The Dance of Life (1029)",
    "plot" : "Burlesque comic Ralph 'Skid' Johnson (Skelly), and dancer Bonny Lee King (Carroll), end up together on a cold, rainy night at a train station, when he's thrown out and she's rejected from the same show. The two things they have in life are dancing and each other, if she could only keep him away from the booze, long enough to keep dancing.",
    "poster" : "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/Poster_of_the_movie_The_Dance_of_Life.jpg/1200px-Poster_of_the_movie_The_Dance_of_Life.jpg",
    "ranking" : 2,
    "lenght" : "1h 20m",
    "videoUrl" : "http://publicdomainmovie.net/movie.php?id=TheDanceOfLifeaugust161929&type=.mp4"
  },

  {
    "id" : 3,
    "category" : 4,
    "name" : "The Brain that Wouldn't Die (1962)",
    "plot" : "Dr. Bill Cortner (Jason Evers) is a successful surgeon who has just saved a patient pronounced dead in the emergency room — a patient of his father (Bruce Brighton) — with an unorthodox surgical method. After the younger Cortner and his beautiful fiancée Jan Compton (Virginia Leith) are involved in a fiery car accident that decapitates Jan, Cortner collects her severed head and rushes it to his home basement laboratory, where he revives it and manages to keep it alive in a liquid-filled tray. Cortner now decides to commit murder to obtain an attractive Head transplant. As he hunts for a suitable specimen at a burlesque bar that night and on the street the next day, Jan begins to hatch a murderous plan. Filled with hatred for Cortner because he won't let her die, she communicates telepathy with a hideous mutant in the laboratory cell, telling it to kill the scientist.",
    "poster" : "https://images-na.ssl-images-amazon.com/images/I/51K46CSZTDL._SY445_.jpg",
    "ranking" : 2,
    "lenght" : "1h 20m",
    "videoUrl" : "http://ia800202.us.archive.org/22/items/the_brain_that_wouldnt_die_ipod/the_brain_that_wouldnt_die_512kb.mp4"
  },

  {
    "id" : 4,
    "category" : 1,
    "name" : "The Ape (1940)",
    "plot" : "Boris Karloff stars Dr Bernard Adrian, who dons an ape skin and begins murdering people so that he can steal their spinal fluids.",
    "poster" : "http://publicdomainmovie.net/wikimedia.php?id=Theape.jpg",
    "ranking" : 2,
    "lenght" : "57m",
    "videoUrl" : "http://publicdomainmovie.net/movie.php?id=TheApe1940_461&type=.mp4"
  },

  {
    "id" : 5,
    "category" : 2,
    "name" : "Abraham Lincoln",
    "plot" : "Brief vignettes about Lincoln's early life include his birth, early jobs, (unsubstantiated) affair with Ann Rutledge, courtship of Mary Todd, and the Lincoln-Douglas debates; his presidency and the Civil War are followed in somewhat more detail, though without actual battle scenes; film concludes with the assassination.",
    "poster" : "https://m.media-amazon.com/images/M/MV5BMTM0Nzk2MDg5N15BMl5BanBnXkFtZTcwOTIyMTMzNA@@._V1_UX182_CR0,0,182,268_AL_.jpg",
    "ranking" : 2,
    "lenght" : "1h 22m",
    "videoUrl" : "http://publicdomainmovie.net/movie.php?id=abraham_lincoln&type=.mp4"
  },

  {
    "id" : 6,
    "category" : 1,
    "name" : "House on Haunted Hill (1959)",
    "plot" : "Eccentric millionaire Frederick Loren (Vincent Price) invites five people to a ''party'' he is throwing for his fourth wife, Annabelle (Carol Ohmart), in an allegedly haunted house he has rented, promising to give them each $10,000 with the stipulation that they must stay the entire night in the house after the doors are locked at midnight. The five guests are test pilot Lance Schroeder (Richard Long (actor)), newspaper columnist Ruth Bridges (Julie Mitchum), psychiatrist Dr. David Trent (Alan Marshal (actor)) who specializes in hysteria, Nora Manning (Carolyn Craig), who works for one of Loren's companies, and the house's owner Watson Pritchard (Elisha Cook Jr.). Pritchard disapproves of Loren's use of the house for his ''party'', making it unclear how Loren acquired access to the house in the first place. Arriving late at night in separate funeral cars with a hearse leading the procession, Loren's guests are told the rules of the party, and each is given a Colt Model 1903 Pocket Hammer for protection. Forced to attend the party, Loren's wife tries to warn the guests that her husband is Psychosis, causing them to be very suspicious of him. Nora becomes convinced that he's trying to kill her when she keeps seeing frightening apparitions, including the ghost of Annabelle, who had apparently hanged herself some time during the night.",
    "poster" : "http://publicdomainmovie.net/wikimedia.php?id=House_on_Haunted_Hill.jpg",
    "ranking" : 2,
    "lenght" : "1h 13m",
    "videoUrl" : "http://publicdomainmovie.net/movie.php?id=house_on_haunted_hill_ipod&type=.mp4"
  },

  {
    "id" : 7,
    "category" : 5,
    "name" : "Popeye for President (1956)",
    "plot" : "Popeye and Bluto are both running for president. They are tied with exactly the same number of votes, but Miss Olive Oyl has yet to cast her ballot. Which candidate will be able to impress her the most and earn her precious vote?",
    "poster" : "https://m.media-amazon.com/images/M/MV5BMjNhMThmODgtYjM4ZS00NWJmLWFiMDItZTUxMGI0Y2VhNDE0XkEyXkFqcGdeQXVyMDY3OTcyOQ@@._V1_.jpg",
    "ranking" : 2,
    "lenght" : "6m",
    "videoUrl" : "http://publicdomainmovie.net/movie.php?id=Popeye_forPresident&type=.mp4"
  },

  {
    "id" : 8,
    "category" : 3,
    "name" : "Charlie Chaplin's ''The Vagabond''",
    "plot" : "he story begins with Charlie, the Tramp, arriving at a bar, playing on a violin to raise money and exciting rivalry with competing musicians - which results in a bar room brawl and comic mayhem. Wandering off into the vicinity of a gypsy caravan, in the country, he encounters the beautiful, though bedraggled, Edna and entertains her with his violin. She has been abducted and abused by the gypsies, chief among them Eric Campbell, who whips her mercilessly. Charlie comes to her rescue and knocks her tormentors on the head with a stick, before riding off with her in a commandeered cart. The intimacy which develops between them, as Charlie washes her face in a bowl and combs her hair, is complicated by the arrival of an artist love rival and her parents. Driving off with the latter, Edna suddenly realises that her heart belongs to Charlie and orders the car to reverse and take him along with her.",
    "poster" : "http://publicdomainmovie.net/wikimedia.php?id=The_Vagabond_%25281916%2529.jpg",
    "ranking" : 2,
    "lenght" : "25m",
    "videoUrl" : "http://publicdomainmovie.net/movie.php?id=CC_1916_07_10_TheVagabond&type=.mp4"
  }
  

]